rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Stanley Kubrick'
---
  def find_with_same_director
    @movie = Movie.find(params[:id])
    @similar_movies = Movie.find_all_by_director(@movie.director)